ElementFilterIsAcceptableForParameterFilterElement Method
Overload List
Name | Description
ElementFilterIsAcceptableForParameterFilterElement(ElementFilter)
 Checks that an ElementFilter is acceptable for use in defining the filtering rules for a ParameterFilterElement (i.e., for view filtering).
ElementFilterIsAcceptableForParameterFilterElement(Document, ISetElementId, ElementFilter)
 Checks that an ElementFilter is acceptable for use in defining the filtering rules for a given list of categories (i.e., for view filtering).
See Also
ParameterFilterElement Class
ParameterFilterElement Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →